# Occupation

### Step 1. 필요한 라이브러리 들을 import 하세요

In [1]:
import pandas as pd
import numpy as np

### Step 2. 다음 주소로 부터 dataset을 import 하세요 [address](https://raw.githubusercontent.com/myoh0623/dataset/main/u.user).

### Step 3. users 변수에 DataFrame을 할당 하세요.
#### index 는 user_id입니다.

In [5]:
data = pd.read_csv('https://raw.githubusercontent.com/myoh0623/dataset/main/u.user',sep='|', index_col = 'user_id')
users = data.copy()

In [10]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [11]:
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4.  occupation별 평균 나이는 얼마입니까?

In [8]:
users.groupby('occupation').mean()

/tmp/ipykernel_2349/2354207670.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  users.groupby('occupation').mean()

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

### Step 5. occupation별 남성의 비율을 확인하고 내림차순으로 정렬하세요

In [50]:
users = data.copy()

In [56]:
users.gender.value_counts()

M    670
F    273
Name: gender, dtype: int64

In [63]:
users[users['gender']=='M'].groupby('occupation')['age'].count() / users.groupby('occupation')['age'].count()

occupation
administrator    0.544304
artist           0.535714
doctor           1.000000
educator         0.726316
engineer         0.970149
entertainment    0.888889
executive        0.906250
healthcare       0.312500
homemaker        0.142857
lawyer           0.833333
librarian        0.431373
marketing        0.615385
none             0.555556
other            0.657143
programmer       0.909091
retired          0.928571
salesman         0.750000
scientist        0.903226
student          0.693878
technician       0.962963
writer           0.577778
Name: age, dtype: float64

In [51]:
users['gender_num'] = 0
users.loc[users['gender'] == 'M',['gender_num']] = 1
users[['gender','gender_num']].head()

        gender  gender_num
user_id
1            M           1
2            F           0
3            M           1
4            M           1
5            F           0

In [32]:
users.groupby('occupation')['gender_num'].mean().sort_values(ascending=False)

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: gender_num, dtype: float64

In [ ]:
# def cond(occ) :
#  users['gender'].value_counts()['M']/ len(users(users['occupation']==occ))
# users.groupby('occupation').apply(cond(occupation)).mean()

### Step 6. 각 occupation별 최대 최소 age를 확인하세요

In [34]:
users.groupby('occupation')['age'].aggregate([np.min,np.max])

               amin  amax
occupation
administrator    21    70
artist           19    48
doctor           28    64
educator         23    63
engineer         22    70
entertainment    15    50
executive        22    69
healthcare       22    62
homemaker        20    50
lawyer           21    53
librarian        23    69
marketing        24    55
none             11    55
other            13    64
programmer       20    63
retired          51    73
salesman         18    66
scientist        23    55
student           7    42
technician       21    55
writer           18    60

### Step 7. occupation에 따른 gender별 평균 age를 계산 하세요

In [41]:
users.groupby(['occupation','gender'])['age'].mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Step 8. 각 occupation별 남성과 여성의 비율을 나타내시오
#### 어려움

In [ ]:
gen_occ = users.groupby(["occupation", "gender"]).agg({"gender":"count"})
count_occ = users.groupby(["occupation"]).agg("count")

In [ ]:
gen_occ.div(count_occ, level="occupation").gender

In [49]:
users.groupby(['occupation','gender'])['age'].count() / users.groupby('occupation')['age'].count()

occupation     gender
administrator  F         0.455696
               M         0.544304
artist         F         0.464286
               M         0.535714
doctor         M         1.000000
educator       F         0.273684
               M         0.726316
engineer       F         0.029851
               M         0.970149
entertainment  F         0.111111
               M         0.888889
executive      F         0.093750
               M         0.906250
healthcare     F         0.687500
               M         0.312500
homemaker      F         0.857143
               M         0.142857
lawyer         F         0.166667
               M         0.833333
librarian      F         0.568627
               M         0.431373
marketing      F         0.384615
               M         0.615385
none           F         0.444444
               M         0.555556
other          F         0.342857
               M         0.657143
programmer     F         0.090909
               M         0.909091
retired        F         0.071429
               M         0.928571
salesman       F         0.250000
               M         0.750000
scientist      F         0.096774
               M         0.903226
student        F         0.306122
               M         0.693878
technician     F         0.037037
               M         0.962963
writer         F         0.422222
               M         0.577778
Name: age, dtype: float64

In [ ]:
users.groupby(['occupation','gender'])['gender_num'].describe()

In [53]:
users.groupby(['occupation','gender'])['age'].value_counts() / users.groupby('occupation')['age'].value_counts()

occupation     age  gender
administrator  21   M         1.000000
               22   F         0.333333
                    M         0.666667
               23   F         0.500000
                    M         0.500000
                                ...
writer         50   M         0.500000
               51   M         1.000000
               52   M         1.000000
               56   F         1.000000
               60   M         1.000000
Name: age, Length: 526, dtype: float64

In [54]:
users.groupby(['occupation','gender']).value_counts() / users.groupby('occupation').value_counts()

occupation     gender  age  zip_code  gender_num
administrator  F       22   60202     0             1.0
                       23   20817     0             1.0
                       25   80538     0             1.0
                       27   19711     0             1.0
                            97214     0             1.0
                                                   ...
writer         M       50   27105     1             1.0
                       51   95468     1             1.0
                       52   08534     1             1.0
                            59801     1             1.0
                       60   94583     1             1.0
Length: 936, dtype: float64

In [55]:
users.groupby(['occupation','gender'])['age'].value_counts() / users.groupby('occupation')['age'].sum()

occupation     gender  age
administrator  F       38     0.000980
                       51     0.000980
                       27     0.000653
                       30     0.000653
                       33     0.000653
                                ...
writer         M       42     0.000612
                       48     0.000612
                       50     0.000612
                       51     0.000612
                       60     0.000612
Name: age, Length: 526, dtype: float64

In [64]:
type(users.count())

pandas.core.series.Series

In [65]:
type(users.value_counts())

pandas.core.series.Series